{
    "meta": {
        "title": "About Barringtons - Family Funeral Directors Since 1902 - Liverpool",
        "description": "Four generations of caring funeral service in Liverpool. Led by David Barrington (NAFD President 2019-2021). Over 3000 memorial trees planted. Trusted, independent & compassionate.",
        "keywords": "family funeral directors Liverpool, independent funeral directors Merseyside, NAFD funeral directors, David Barrington, established funeral services"
    },
    "about": {
        "intro": {
            "title": "About the Barrington's Team",
            "subtitle": "A family caring for families",
            "description1": "As a family-run business we've committed to each of our families by staffing our branches with warm, diverse and genuinely compassionate people.&nbsp;",
            "description2": "Founded by Bill Barrington, David's father, this funeral service has been an integral part of Liverpool's community for many years. <br>Now owned and run by David and Claire Barrington, we understand that every family has a story, and every goodbye deserves to be as unique and special as the life it honours. Having always been members of the local community, while growing up and now still living in Waterloo.&nbsp;<br><br>We have steadily grown the business looking after local families, always striving to bring a better level of service than before. Constantly trying to innovate and pursue higher standards.<br><br>David and Claire have two daughters, Nell, is currently studying illustration at the University of Arts London and Anna is in her GCSE year at school and a proud member of the rowing team and Navy Cadet Force.&nbsp;<br>As a family they are keen skiers, and enjoy cinema, live music and good food.<br><br>",
            "image": "\/assets\/images\/uploads\/img_690a8e3b35486_1762299451.jpg"
        },
        "company": {
            "number": "07587745"
        },
        "david": {
            "name": "David Barrington",
            "title": "Director | NAFD President 2019-2021 | NAFD Approved Tutor",
            "description": "David took over from Bill Barrington, his Father. He began by improving and developing the main services needed to help families through their most difficult times. His full-circle funeral story began by helping his Dad by cleaning the hearse and limousines when he was young and working on funerals&nbsp;once he passed his driving test aged 17. David took the reins in 1995 aged 26 after a period working in the IT industry, mainly as Bill wanted to retire. <br>David achieved the NAFD Diploma of Funeral Directing in 2000 and has since qualified as an NAFD Approved Tutor and has a strong focus on lifelong learning and development for all our team.<br>David has served in various committees with the National Association of Funeral Directors since 2015 and became NAFD President in 2019 unusually remaining in this role for 2 years during the Covid pandemic.&nbsp;<br><br>Q. What do you do outside of work<br>Away from work I enjoy the Cinema, cooking and spending time with the family. I also love gadgets much to the teams dismay sometimes when I get excited about something new.&nbsp; &nbsp;<br><br>Q. What do you enjoy about working in funeral service.&nbsp;<br>I like to hear peoples stories, about their lives and their history. I like helping people and making the funeral journey easier too. It's a privilege. Lastly I like working with my team who are so supportive of everyone we look after. It's a special place to work.&nbsp;<br>",
            "image": "\/assets\/images\/uploads\/img_68ef9c729963b_1760533618.JPG"
        },
        "claire": {
            "name": "Claire Barrington",
            "title": "Director | B.A.Hons, Dip FD, Dip FAA&nbsp;",
            "description": "Claire began her career in people management and strong customer service industries. With a yearning to move back into a world which involved her Art History Degree background she moved from people and food into running her own art galleries. Latterly, and now with over 15 years experience she joined David within the family business. This brought her drive and continuing eye for detail with the designs of each new Barrington's branch. Her aim was to create places of welcome, trust and calm. <br>For every family we look after, there is always a very high level of care and dedication, with a lean towards listening to what's not said or how we can make the journey forwards and on the day especially relevant and important. The aim is always to provide continuity with the needed support to navigate on through to the funeral. Claire is keen to ensure our standards are kept very high.<br><br>Q: Why did you choose to work within this industry?.<br>A: David had his business and I had my own career. We would come together at the end of the day to decompress and share our stories. When life changed direction and the children came along, the opportunity came about to work together - and so far so good, it has worked!&nbsp;<br><br>Q: What do you do outside of work?<br>A: I enjoy Yoga, watching most sports, always eating great food and going to the Theatre as much as possible.<br><br>",
            "image": "\/assets\/images\/uploads\/img_68e517f23c50a_1759844338.jpg"
        },
        "staff": [
            {
                "name": "Julie I'Anson",
                "title": "Senior Funeral Director | Dip FAA, NDSF&nbsp;",
                "description": "Julie is the staff team leader for Barringtons, she brings a wealth of knowledge &amp; life experience along with a background in teaching and the floristry world. Compassionate and creative with a keen knowledge of the industry to share<br>with of our families during their most difficult times. Julie is dedicated to every funeral making sure the whole family are handled with professionalism and care.&nbsp;<br>Julie has had many years in the funeral industry.<br><br>Q: Why did you choose to work for Barringtons Funeral Services?<br style=\"color: rgb(0, 0, 0); font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 16px;\">A: I was a florist and very proud of my achievements",
                "image": "\/assets\/images\/uploads\/img_690cbc11c23bf_1762442257.jpg"
            },
            {
                "name": "Beth Wade",
                "title": "Funeral Director | BSc Ph Biology Yr 1 \/ Triple Science&nbsp; &nbsp;",
                "description": "Beth has a passion for good funerals and learning - coming from Liverpool UTC with time spent learning through the hospital mortuary setting and a love of science, Beth spent the first 7 months with us as a volunteer. Nothing easily deters Beth and when Covid came along, Beth became a full time team member with Barringtons and has never looked back. Beth is currently studying for her Diploma In Funeral Administration and Arranging alongside arranging and conducting full funerals of her own.&nbsp;<br><br>Beth has a passion for good funerals and learning - coming from Liverpool UTC with time spent learning through the hospital mortuary setting and a love of science, Beth spent the first 7 months with us as a volunteer. Nothing easily deters Beth and when Covid came along she became a full time team member with Barringtons and has never looked back. Beth is currently studying for her Diploma In Funeral Administration and Arranging alongside arranging and conducting full funerals of her own.&nbsp;<br><br><div data-olk-copy-source=\"MessageBody\" style=\"font-size: 12pt; border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-variant-emoji: inherit; font-stretch: inherit; line-height: inherit; font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-optical-sizing: inherit; font-size-adjust: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; color: black; background-color: white;\">Q: Why do you choose to work for Barringtons?<br><span data-olk-copy-source=\"MessageBody\">A: I never intended to work within the funeral industry, but Barringtons had conducted previous family funerals and they were the people I turned to, more for advice about the industry and where to start. Barringtons offered me a volunteering position for me to build my knowledge and meet relevant people for the future I wanted. 12 weeks of volunteering turned into 7 months over Covid, which turned into a full time job!<br><br><\/span><\/div><div style=\"font-size: 12pt; border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-variant-emoji: inherit; font-stretch: inherit; line-height: inherit; font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-optical-sizing: inherit; font-size-adjust: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; color: black; background-color: white;\">Q: Why have you chosen to work in the funeral industry?<br><span data-olk-copy-source=\"MessageBody\">A: After volunteering and seeing all sides of the industry, I realised that actually, working with both families and their loved ones was far more rewarding. Getting to hear life stories, while making people look their best, is the best of it all.<br><br><\/span><\/div><div style=\"font-size: 12pt; border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-variant-emoji: inherit; font-stretch: inherit; line-height: inherit; font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-optical-sizing: inherit; font-size-adjust: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; color: black; background-color: white;\">Q: What do I do outside of work?<br>A:&nbsp;<span style=\"color: inherit; font-family: inherit; font-size: inherit; font-style: inherit; font-variant-ligatures: inherit; font-variant-caps: inherit; font-weight: inherit;\">I have recently started reformer pilates, which has been going great. I also like to get comfy and read books.&nbsp;<\/span><\/div>",
                "image": "\/assets\/images\/uploads\/img_68e517b5c34dd_1759844277.jpg"
            },
            {
                "name": "Debbie Fraser",
                "title": "Funeral Director",
                "description": "Debbie looks after the Netherton branch of Barringtons and is a vital part of the team and a vital part of the local community. Her gentle yet keen approach help families navigate the practical aspects of funeral arrangements. Debbie has an understanding of what a family need and how to make this happen. She has a wealth of background experience with teaching and supporting children with learning issues to name a few. There's not much Debbie hasn't done, but she too will fully arrange and conduct her funeral services.&nbsp;",
                "image": "\/assets\/images\/uploads\/img_68e3f4e0c55e7_1759769824.jpg"
            },
            {
                "name": "Angie Allen",
                "title": "Funeral Director",
                "description": "<br><div data-olk-copy-source=\"MailCompose\" style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">With 25 years in the profession, Angie brings both expertise and experience in her role. A caring and very experienced funeral director who will can always be relied upon to deliver exactly what the family are looking for with compassion and diligence.<br><br><\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">Q: Why do you choose to work for Barringtons?<\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">A: The opportunity arose when I realised I had been working for a Funeral Directors which was now owned by a bigger company and felt that it was time to return to an independent Funeral Directors, as I felt I had more to offer families.<br><br><\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">Q: Why have you chosen to work in the funeral industry?<\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">A: I was working for the Archdiocese of Liverpool, and after 22 years felt that I needed a change.<\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">The opportunity came up to work for an Independent Funeral Directors which I did not need training for as they would train me. I found out that I really enjoyed helping families and looking after their loved ones. I stayed with them even when they went onto be owned by a bigger company.&nbsp; I felt it lacked the compassion and empathy you have when it is more of a family run business.<\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">This is not a job to me, it is me extending my family each time I get meet another family.<br><br><\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">Q: What do I do outside of work<\/div><div style=\"font-family: Aptos, Aptos_EmbeddedFont, Aptos_MSFontService, Calibri, Helvetica, sans-serif; font-size: 12pt; color: rgb(0, 0, 0);\">A: I get together with my family and friends as often as I can. You learn in this type of industry, life is too short, so spend as much time with your loved ones as you possibly can.<\/div><br><br>",
                "image": "\/assets\/images\/uploads\/img_68e3f4e915242_1759769833.jpg"
            },
            {
                "name": "Josh Rice",
                "title": "Funeral Operative Lead",
                "description": "Over 10 years now with the company, Josh has also come through the ranks to serve our families alongside the team. Recently passing his Level 2 Funeral Operative Apprenticeship with a distinction Josh's will to make a difference hasn't gone unnoticed. Always a favourite with the families we care for, his warm and friendly approach puts people at ease.&nbsp;<br>Josh plays football religiously with a his local league and his role as captain of the Remyca Reserves FC football team allows him to support in the directing of the squad.&nbsp;<br><br>Q: Why did you choose to work for Barringtons?<br>A: When I was younger I helped my dad to clean the cars after school. Then when I passed my driving test David let me drive on funerals part time. For a while I worked for a car-hire firm full time in their office, I decided to see if there were any roles available here as I preferred to be out and about. It was the best decision I ever made career wise. I feel valued and supported and we have a great team to work with.&nbsp;<br><br>Q: What do you enjoy about funeral service?<br>A: I love helping the families we look after and making sure people are presented in the best way possible. People think that working here is depressing but we hear lots of peoples stories and there is actually more laughing than you would think. It's an honour to help people with this very personal time.&nbsp;<br>",
                "image": "\/assets\/images\/uploads\/img_68ea603947ea1_1760190521.jpg"
            },
            {
                "name": "Paul McCollah",
                "title": "Funeral Operative",
                "description": "Paul has been with Barringtons for over 3 years now and began as a dedicated driver on funeral services. With a previous background in the military and latterly his own high quality painting and decorating business, Paul enjoys the details and making things right. These skills are key to becoming a strong funeral operative and the role Paul has now covers all the aspects of the funeral day from caring for the deceased, driving during the funerals and so much more.<br><div>Q: Why did you choose to work for Barrington’s?<\/div><div>A: After choosing Barrington’s to take care of my mum's funeral arrangements and seeing first hand how they operated, I knew that I wanted to be a part of their team.&nbsp;<\/div><div>Q: Why choose the funeral industry?<\/div><div>A: To provide a service that is necessary. To make a tough time for families go smoothly and there’s nothing more rewarding than a family member shaking your hand at the end of a job and saying thank you.&nbsp;<\/div><div>Q: What do I do out of work?<\/div><div>A: I’m involved with my daughter’s special Olympics swimming team and travel to galas all over the country, cycle to keep fit and enjoy walking.<\/div><br><br><br>",
                "image": "\/assets\/images\/uploads\/img_68ea602f86d65_1760190511.jpg"
            }
        ],
        "promise": {
            "title": "Our Promise to You",
            "description": "When you choose Barringtons, you're entrusting us with the privilege of celebrating your loved one's life. We promise to guide you with patience and care, always respecting your wishes, no matter how unique or traditional they are. It's all about getting things right.&nbsp;",
            "trusted_title": "Trusted Care",
            "trusted_description": "As a company we are proud members of the National Association of Funeral Directors (NAFD), Society of Allied and Independent Funeral Directors (SAIF), Association of Green Funeral Directors, and recommended by the Good Funeral Guide for our high standards of care.<br>We also pledge to be as environmentally sound as we can be and we hold a Gold Standard from the Greener Globe Funeral Standard for our continuing ethos to help the planet.&nbsp;<br>",
            "growing_title": "Growing Hope",
            "growing_description": "For every funeral we arrange, we plant a memorial tree - over 3,500 planted so far. It's our way of creating something lasting and positive from moments of loss, providing families with a living tribute to their loved one. Our partners plant trees in and around the UK and have&nbsp;",
            "growing_image": "\/assets\/images\/uploads\/img_68dfa02a705f3_1759485994.jpg"
        },
        "locations": {
            "title": "3 Offices - Always close by",
            "subtitle": "With three conveniently located offices across North Liverpool, we're always nearby when you need us.",
            "waterloo": {
                "name": "Waterloo Office",
                "tag": "Main Office - 24 Hour Support on call",
                "address": "23 Crosby Rd North, Waterloo, L22 4QF",
                "hours": "Monday - Friday, 9am - 5pm",
                "note": "Our main office with full facilities including chapels of rest and arrangement rooms upstairs and downstairs. Wheelchair accessible with ramp."
            },
            "formby": {
                "name": "Formby Office",
                "tag": "24hr Support on call",
                "address": "49 Liverpool Road, Formby, L37 6BT.",
                "hours": "Monday - Friday, 10am -4pm",
                "note": "Serving the Formby community with personal, dedicated service, including chapels of rest. Wheelchair accessible with 1 step."
            },
            "netherton": {
                "name": "Netherton Office",
                "tag": "24hr Support on call",
                "address": "38 The Marian Square, Netherton, L30 5QA",
                "hours": "Monday to Friday, 9am - 5pm",
                "note": "Beautiful contemporary offices with full facilities, chapels and our coffin showroom. Wheelchair accessible \/ level access."
            },
            "contact_banner": {
                "text": "For immediate assistance or to arrange a visit to any of our offices:",
                "phone": "Call us 24\/7 on 0151 928 1625"
            }
        }
    },
    "hero": {
        "title": "About Us",
        "image": "\/assets\/images\/uploads\/img_68ea64aed26b4_1760191662.jpg"
    }
}